# -*- coding: utf-8 -*-
from pprint import pprint

uz_countries = ['ангрен', 'андижон', 'арнасой', 'ашхабод', 'бекобод', 'бишкек', 'бойсун', 'булоқбоши', 'бурчмулла', 'бухоро', 'газли', 'гулистон', 'денов', 'деҳқонобод', 'дўстлик', 'душанбе', 'жалолобод', 'жамбул', 'жиззах', 'жомбой', 'зарафшон', 'зомин', 'каттақўрғон', 'конибодом', 'конимех', 'косон', 'косонсой', 'марғилон', 'мингбулоқ', 'муборак', 'мўйноқ', 'навоий', 'наманган', 'нукус', 'нурота', 'олмаота', 'олот', 'олтиариқ', 'олтинкўл', 'пахтаобод', 'поп', 'риштон', 'сайрам', 'самарқанд', 'таллимаржон', 'тахтакўпир', 'термиз', 'томди', 'тошкент', 'тошҳовуз', 'туркистон', 'туркманобод', 'тўрткўл', 'узунқудуқ', 'урганч', 'ургут', 'ўсмат', 'учтепа', 'учқудуқ', 'учқўрғон', 'ўш', 'ўғиз', 'фарғона', 'хазорасп', 'хива', 'хонобод', 'хонқа', 'хўжанд', 'хўжаобод', 'чимбой', 'чимкент', 'чортоқ', 'чуст', 'шаҳрихон', 'шеробод', 'шовот', 'шуманай', 'янгибозор', 'ғаллаорол', 'ғузор', 'қарши', 'қизилтепа', 'қоракўл', 'қоровулбозор', 'қува', 'қумқўрғон', 'қўнғирот', 'қўрғонтепа', 'қўқон']
region_ids = ['43', '1', '52', '90', '2', '3', '76', '73', '44', '4', '46', '5', '6', '84', '51', '89', '7', '8', '9', '10', '61', '50', '11', '12', '59', '86', '34', '13', '64', '88', '68', '14', '15', '16', '17', '41', '45', '38', '69', '49', '32', '39', '42', '18', '87', '66', '74', '58', '27', '92', '19', '91', '65', '62', '78', '72', '53', '56', '63', '36', '20', '57', '37', '79', '21', '31', '80', '22', '29', '67', '23', '35', '33', '28', '77', '82', '70', '81', '55', '85', '25', '60', '48', '47', '40', '75', '71', '30', '26']

NAMAZ_NAMES = {
    0: "Bomdod",
    1: "Quyosh",
    2: "Peshin",
    3: "Asr",
    4: "Shom",
    5: "Xufton"
}